# Написать калькулятор. Программа должна содержать 4 функции
# принимающие два аргумента и возвращающие результаты сложения,
# вычитания, умножения и деления. Реализовать пользовательский интерфейс
# с бесконечным циклом. Добавить валидацию входных данных. Программа
# должна состоять из четырех файлов(main.py, func.py, ui_func.py exceptions.py).


def addition(a, b):
    return a + b


def subtraction(a, b):
    return a - b


def multiplication(a, b):
    return a * b


def division(a, b):
    return a / b
