# Создать csv файл с данными о ежедневной погоде. Стурктура:
# Дата, Место, Градусы, Скорость ветра. Найти среднюю погоду
# (скорость ветра и градусы) для Минск за последние 7 дней.


from csv_utils import (write_csv, read_csv)


def main():
    filename = 'task_10_02.txt'
    fields = ('Дата', 'Место', 'Градусы', 'Скорость ветра')
    rows = [
        ['27.11.2019', 'Минск', -3, 3.4],
        ['27.11.2019', 'Москва', -5, 5.1],
        ['28.11.2019', 'Минск', -4, 3.7],
        ['28.11.2019', 'Москва', -7, 4],
        ['29.11.2019', 'Минск', -1, 3.9],
        ['29.11.2019', 'Москва', -10, 2.2],
        ['30.11.2019', 'Минск', 0, 1],
        ['30.11.2019', 'Москва', -9, 1.5],
        ['01.12.2019', 'Минск', 1, 2.1],
        ['01.12.2019', 'Москва', -6, 3.3],
        ['02.12.2019', 'Минск', 3, 2.5],
        ['02.12.2019', 'Москва', -4, 4.1],
        ['03.12.2019', 'Минск', -1, 3],
        ['03.12.2019', 'Москва', -7, 1],
        ['04.12.2019', 'Минск', -3, 2.4],
        ['04.12.2019', 'Москва', -6, 1.3],
        ['05.12.2019', 'Минск', 0, 2.8],
        ['05.12.2019', 'Москва', -5, 0.8],
    ]

    write_csv(filename, fields, rows)

    new_fields, new_rows = read_csv(filename)
    print(new_fields)
    for line in new_rows:
        print(line)

    minsk_data = list(filter(lambda row: row[1] == 'Минск', new_rows))
    t_minsk = [float(elem[-2]) for elem in minsk_data[-7::]]
    ws_minsk = [float(elem[-1]) for elem in minsk_data[-7::]]

    mean_t_minsk = round(sum(t_minsk)/7,1)
    mean_ws_minsk = round(sum(ws_minsk)/7,1)

    print(f'Средняя температура в Минске за последние 7 дней: {mean_t_minsk} градусов.',
          f'Средняя скорость ветра в Минске за последние 7 дней: {mean_ws_minsk} м/с.', sep='\n')


if __name__ == '__main__':
    main()
