# Дан список словарей. Каждый словарь описывает машину (серийный номер и год выпуска).
# Создать новый список со всеми машинами, год выпуска которых больше n.


n = 1997
car_list = [
    {'id': '001', 'year': 1995},
    {'id': '002', 'year': 1998},
    {'id': '003', 'year': 1993},
    {'id': '004', 'year': 2000},
    {'id': '005', 'year': 2010},
    {'id': '006', 'year': 1997}
]
new_cars = [car for car in car_list if car['year'] > n]
print(new_cars)
