# Дан список слов. Сгенерировать новый список с перевернутыми словами.


name_list = ['max', 'kate', 'jane', 'nick']
reverse_name_list = [name[::-1] for name in name_list]
print(reverse_name_list)
